class QuickSort:
    _PIVOT = []
    def standard_quicksort(self, array, scheme='lomute', pivot='last', time_count=False, details_need=False, inplace=False, _equations=0, _memory=0, _swaps=0):
        """а) Реалiзувати алгоритм швидкого сортування зi схемами розбиття Ломуто та Гоара, а
також вибором опорного елемента як останнього елемента, випадкового елемента,
медiани першого, останнього та середнього елементiв i медiани трьох випадкових
елементiв (з пiдтримкою обчислення часу виконання, кiлькостi проведених порiвнянь,
операцiй переставляння елементiв та використаної пам’ятi). (Загальна кiлькiсть
модифiкацiй дорiвнює 8 — 2 схеми розбиття times 4 методи вибору опорного елемента.)"""
    pass
